# CantChangeParamMirror Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PointFailures..::..CantChangeParamMirror Property
BuiltInFailures..::..PointFailures Class See Also
---
Can't mirror Element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantChangeParamMirror { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantChangeParamMirror As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantChangeParamMirror {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..PointFailures Class
Autodesk.Revit.DB Namespace